A1 = {'x': 0, 'y': 0}
A2 = {'x': 0, 'y': 0}
A3 = {'x': 0, 'y': 0}
A4 = {'x': 0, 'y': 0}
A1['x'] = input('Введите значение координаты x для A1: ')
A1['y'] = input('Введите значение координаты y для A1: ')
A2['x'] = input('Введите значение координаты x для A2: ')
A2['y'] = input('Введите значение координаты y для A2: ')
A3['x'] = input('Введите значение координаты x для A3: ')
A3['y'] = input('Введите значение координаты y для A3: ')
A4['x'] = input('Введите значение координаты x для A4: ')
A4['y'] = input('Введите значение координаты y для A4: ')
print("Координаты точки A1:" ,A1)
print("Координаты точки A2:" ,A2)
print("Координаты точки A3:" ,A3)
print("Координаты точки A4:" ,A4)

def CheckPar(A1,A2,A3,A4):
    A1x = int(A1.get("x"))
    A1y = int(A1.get("y"))
    A2x = int(A2.get("x"))
    A2y = int(A2.get("y"))
    A3x = int(A3.get("x"))
    A3y = int(A3.get("y"))
    A4x = int(A4.get("x"))
    A4y = int(A4.get("y"))
    if (A2x - A1x) == (A3x - A4x) and (A3x - A2x) == (A4x - A1x) and (A2y - A1y) == (A3y - A4y) and (A3y - A2y) == (A4y - A1y):
        print("Это параллелограмм!")
    else:
        print("Какая-то непонятная фигура :(")

CheckPar(A1,A2,A3,A4)
